Revit 2027 API
SpecTypeId.Wattage Property
 Wattage, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Wattage { get; }
Public Shared ReadOnly Property Wattage As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Wattage {
	ForgeTypeId^ get ();
}
static member Wattage : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace